In [10]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline
import warnings
warnings.filterwarnings('ignore')

In [2]:
data=pd.read_csv('nefty_50.csv')

In [3]:
data.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2022-11-17,18358.699219,18417.599609,18312.949219,18343.900391,18343.900391,200500
1,2022-11-18,18382.949219,18394.599609,18209.800781,18307.650391,18307.650391,198800
2,2022-11-21,18246.400391,18262.300781,18133.349609,18159.949219,18159.949219,213800
3,2022-11-22,18179.150391,18261.849609,18137.699219,18244.199219,18244.199219,177700
4,2022-11-23,18325.199219,18325.400391,18246.000000,18267.250000,18267.250000,178800

In [4]:
data.isnull().sum()

Date         0
Open         0
High         0
Low          0
Close        0
Adj Close    0
Volume       0
dtype: int64

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 249 entries, 0 to 248
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       249 non-null    object
 1   Open       249 non-null    float64
 2   High       249 non-null    float64
 3   Low        249 non-null    float64
 4   Close      249 non-null    float64
 5   Adj Close  249 non-null    float64
 6   Volume     249 non-null    int64
dtypes: float64(5), int64(1), object(1)
memory usage: 13.7+ KB

In [6]:
data.shape

(249, 7)

In [7]:
data.describe()

,Open,High,Low,Close,Adj Close,Volume
count,249.000000,249.000000,249.000000,249.000000,249.000000,249.000000
mean,18635.170479,18697.575223,18543.069410,18622.696842,18622.696842,253908.835341
std,840.010496,836.568594,853.600034,846.415078,846.415078,74122.456997
min,16977.300781,17061.750000,16828.349609,16945.050781,16945.050781,0.000000
25%,17950.400391,18047.400391,17824.349609,17915.050781,17915.050781,215100.000000
50%,18595.050781,18633.599609,18528.400391,18563.400391,18563.400391,244500.000000
75%,19450.550781,19507.699219,19369.000000,19434.550781,19434.550781,275100.000000
max,20156.449219,20222.449219,20129.699219,20192.349609,20192.349609,696500.000000

In [8]:
data.columns

Index(['Date', 'Open', 'High', 'Low', 'Close', 'Adj Close', 'Volume'], dtype='object')

In [12]:
data.drop('High',axis=1,inplace=True)
data.drop('Low',axis=1,inplace=True)
data.drop('Adj Close',axis=1,inplace=True)
data.drop('Volume',axis=1,inplace=True)

In [13]:
data.head()

         Date          Open         Close
0  2022-11-17  18358.699219  18343.900391
1  2022-11-18  18382.949219  18307.650391
2  2022-11-21  18246.400391  18159.949219
3  2022-11-22  18179.150391  18244.199219
4  2022-11-23  18325.199219  18267.250000

In [19]:
data['Year']=data['Date'].str.split('-').str[0]
data['Month']=data['Date'].str.split('-').str[1]
data['Day']=data['Date'].str.split('-').str[2]
data.drop('Date',axis=1,inplace=True)

In [20]:
data.head()

           Open         Close  Year Month Day
0  18358.699219  18343.900391  2022    11  17
1  18382.949219  18307.650391  2022    11  18
2  18246.400391  18159.949219  2022    11  21
3  18179.150391  18244.199219  2022    11  22
4  18325.199219  18267.250000  2022    11  23

In [21]:
data.to_csv('nefty_50_cleaned_1.csv',index=False)